import type { Process } from '@/entities';

// процессы можно захардкодить согласно ТЗ
export const processes: Process[] = [
  {
    id: 'proc-1',
    label: 'Оптимизация процессов, улучшение их показателей',
    x: 80,
    y: 100,
    width: 200,
    height: 120,
  },
  {
    id: 'proc-2',
    label:
      'Оптимизация процессов, улучшение их показателей и повышение эффективности работы',
    x: 400,
    y: 250,
    width: 220,
    height: 130,
  },
  {
    id: 'proc-3',
    label: 'Используйте инструмент для создания блок',
    x: 780,
    y: 120,
    width: 200,
    height: 120,
  },
  {
    id: 'proc-4',
    label: 'Используйте инструмент для создания блок',
    x: 1000,
    y: 500,
    width: 200,
    height: 120,
  },
];
